app/controllers/application_controller.rb

  def show
    @movie = Movie.find_by_id(params['id'])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 2 LIMIT 1

  def create
    m = Movie.new
    m.url = params['url']
    m.description = params['description']
    m.title = params['title']
    m.save
---
INSERT INTO "movies" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-29 16:52:27.128634"], ["description", "desc"], ["title", "movie name"], ["updated_at", "2014-07-29 16:52:27.128634"], ["url", "url"]]

  def edit
      @Movie = Movie.find_by_id(params['id'])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = 10 LIMIT 1